# -*- coding: utf-8-unix; lexical-binding: t; -*-
#+TITLE: 并行 I​/​O 密集型任务的最佳线程数
#+AUTHOR: [[https://github.com/shynur][/谢骐/]]
#+LANGUAGE: zh-CN
#+HTML_HEAD: <style> table, th, td {border: 1px solid;} code {box-sizing: border-box; background-color: #F3F5F9; color: #0ABF5B;} </style>

** 测试

#+BEGIN_SRC bash  :eval query  :exports both table  :dir (file-name-concat "/sudo::" (expand-file-name (file-name-directory (buffer-file-name))))
MY_NUM_THREADS=9  \
MY_NUM_FILES=10000  \
MY_AMOUNT_CALC=100  \
make
make clean
#+END_SRC

#+RESULTS:
| Num-Threads | O-Time-per-File | I-Time    | IO-Time   |
|           1 | 99.5324us       | 72.9784us | 80.1102us |
|           2 | 53.3164us       | 38.1627us | 46.0702us |
|           3 | 38.7215us       | 28.9921us | 33.8469us |
|           4 | 31.8808us       | 23.2954us | 27.3944us |
|           5 | 27.3368us       | 20.6604us | 23.5418us |
|           6 | 25.8475us       | 17.8479us | 21.0984us |
|           7 | 24.3816us       | 18.7930us | 21.2713us |
|           8 | 27.5352us       | 20.1203us | 22.1087us |
|           9 | 35.6278us       | 25.3981us | 26.3765us |

